backend/modules/HumanResource/Support/EmployeeRetirementService.php

    public function dueCount(?User $user = null, ?Carbon $asOf = null): int
    {
        $asOf = $asOf ? $asOf->copy()->startOfDay() : Carbon::today();
        $dueDobThreshold = $asOf->copy()->subYears(self::DEFAULT_RETIREMENT_AGE)->toDateString();

        $query = Employee::query()
            ->where('is_active', true)
            ->whereNotNull('date_of_birth')
            ->whereDate('date_of_birth', '<=', $dueDobThreshold);

        $this->applyManagedBranchScope($query, $this->managedBranchIds($user));

        return (int) $query->count();
---
select count(*) as aggregate from `employees` where `is_active` = 1 and `date_of_birth` is not null and date(`date_of_birth`) <= '1966-05-02' and `employees`.`deleted_at` is null

    public function upcomingCount(?User $user = null, ?Carbon $asOf = null, int $months = self::DEFAULT_UPCOMING_MONTHS): int
    {
        $asOf = $asOf ? $asOf->copy()->startOfDay() : Carbon::today();
        $months = max(1, $months);
        $dueDobThreshold = $asOf->copy()->subYears(self::DEFAULT_RETIREMENT_AGE)->toDateString();
        $upcomingDobThreshold = $asOf->copy()->addMonths($months)->subYears(self::DEFAULT_RETIREMENT_AGE)->toDateString();

        $query = Employee::query()
            ->where('is_active', true)
            ->whereNotNull('date_of_birth')
            ->whereDate('date_of_birth', '>', $dueDobThreshold)
            ->whereDate('date_of_birth', '<=', $upcomingDobThreshold);

        $this->applyManagedBranchScope($query, $this->managedBranchIds($user));

        return (int) $query->count();
---
select count(*) as aggregate from `employees` where `is_active` = 1 and `date_of_birth` is not null and date(`date_of_birth`) > '1966-05-02' and date(`date_of_birth`) <= '1967-05-02' and `employees`.`deleted_at` is null

    public function dueEmployees(?User $user = null, ?Carbon $asOf = null, int $limit = 10): Collection
    {
        $asOf = $asOf ? $asOf->copy()->startOfDay() : Carbon::today();
        $dueDobThreshold = $asOf->copy()->subYears(self::DEFAULT_RETIREMENT_AGE)->toDateString();

        $query = Employee::query()
            ->with(['department', 'sub_department', 'position'])
            ->where('is_active', true)
            ->whereNotNull('date_of_birth')
            ->whereDate('date_of_birth', '<=', $dueDobThreshold)
            ->orderBy('date_of_birth')
            ->orderBy('last_name')
            ->orderBy('first_name');

        $this->applyManagedBranchScope($query, $this->managedBranchIds($user));

        return $query
            ->limit(max(1, $limit))
            ->get()
            ->map(function (Employee $employee) {
                $employee->setAttribute('retirement_age', self::DEFAULT_RETIREMENT_AGE);
                $employee->setAttribute(
                    'retirement_date',
                    Carbon::parse($employee->date_of_birth)->addYears(self::DEFAULT_RETIREMENT_AGE)->toDateString()
                );
                $employee->setAttribute(
                    'display_unit_name',
                    $employee->sub_department?->department_name ?: ($employee->department?->department_name ?: '-')
                );

                return $employee;
            });
---
select * from `employees` where `is_active` = 1 and `date_of_birth` is not null and date(`date_of_birth`) <= '1966-05-02' and `employees`.`deleted_at` is null order by `date_of_birth` asc, `last_name` asc, `first_name` asc limit 6