backend/modules/HumanResource/Support/OrgScopeService.php

    public function userDepartment(?User $user = null): ?Department
    {
        $user = $user ?: Auth::user();
        if (!$user) {
            return null;
        }

        $uid = (int) $user->id;
        if (array_key_exists($uid, static::$deptCache)) {
            return static::$deptCache[$uid];
        }

        /** @var UserOrgRole|null $orgRole */
        $orgRole = $this->orgHierarchyAccessService->effectiveOrgRoles($user)->first();

        if (!$orgRole || !$orgRole->department_id) {
            return static::$deptCache[$uid] = null;
        }

        $dept = Department::withoutGlobalScopes()->find($orgRole->department_id);
---
select * from `departments` where `departments`.`id` = 54 limit 1

    public function resolveLevelFromDepartment(Department $dept): string
    {
        if (isset(self::LEVEL_MAP[$dept->unit_type_id])) {
            return self::LEVEL_MAP[$dept->unit_type_id];
        }

        // Walk up parent chain to find a known level
        $current = $dept;
        $guard = 0;
        while ($current->parent_id && $guard < 5) {
            $parent = Department::withoutGlobalScopes()
                ->select('id', 'parent_id', 'unit_type_id')
                ->find($current->parent_id);
---
select `id`, `parent_id`, `unit_type_id` from `departments` where `departments`.`id` = 16 limit 1