backend/modules/HumanResource/Support/OrgUnitRuleService.php

select * from `departments` where `deleted_at` is null and `is_active` = 1 and `unit_type_id` is not null order by COALESCE(sort_order, 999999) asc, `department_name` asc
select * from `org_unit_types` where `org_unit_types`.`id` in (1, 2, 3, 4, 6, 7, 10)
---
    protected function activeUnits(): Collection
    {
        return Department::withoutGlobalScopes()
            ->with('unitType')
            ->whereNull('deleted_at')
            ->where('is_active', true)
            ->whereNotNull('unit_type_id')
            ->orderByRaw('COALESCE(sort_order, 999999) asc')
            ->orderBy('department_name')
            ->get();