backend/modules/HumanResource/Support/WorkflowActorResolverService.php

    protected function resolveEffectiveActorUserId(int $userId, array $visited = []): int
    {
        if ($userId <= 0) {
            return 0;
        }

        if (in_array($userId, $visited, true) || count($visited) >= 5) {
            return $userId;
        }

        $visited[] = $userId;
        $user = User::query()
            ->withoutGlobalScope('sortByLatest')
            ->find($userId, ['id']);
        if (!$user || !method_exists($user, 'employee')) {
            return $userId;
        }

        $employee = $user->employee()->first(['id', 'user_id']);
        if (!$employee) {
            return $userId;
        }

        $today = Carbon::today()->toDateString();
        $activeLeave = ApplyLeave::query()
            ->with('handoverEmployee:id,user_id')
            ->where('employee_id', (int) $employee->id)
            ->where(function ($query) {
                $query->where('is_approved', 1)
                    ->orWhere('workflow_status', 'approved');
            })
            ->where(function ($query) use ($today) {
                $query->where(function ($inner) use ($today) {
                    $inner->whereNotNull('leave_approved_start_date')
                        ->whereNotNull('leave_approved_end_date')
                        ->whereDate('leave_approved_start_date', '<=', $today)
                        ->whereDate('leave_approved_end_date', '>=', $today);
                })->orWhere(function ($inner) use ($today) {
                    $inner->whereDate('leave_apply_start_date', '<=', $today)
                        ->whereDate('leave_apply_end_date', '>=', $today);
                });
            })
            ->orderByDesc('id')
            ->first();
---
select * from `apply_leaves` where `employee_id` = 1115 and (`is_approved` = 1 or `workflow_status` = 'approved') and ((`leave_approved_start_date` is not null and `leave_approved_end_date` is not null and date(`leave_approved_start_date`) <= '2026-05-02' and date(`leave_approved_end_date`) >= '2026-05-02') or (date(`leave_apply_start_date`) <= '2026-05-02' and date(`leave_apply_end_date`) >= '2026-05-02')) and `apply_leaves`.`deleted_at` is null order by `id` desc, `id` desc limit 1