backend/modules/Correspondence/Http/Controllers/CorrespondenceController.php

select * from `correspondence_letters` where `correspondence_letters`.`id` = 26 and `correspondence_letters`.`deleted_at` is null limit 1
---
                ->with('error', localize('letter_not_found', 'Letter was not found.'));
        }

        $letter = CorrespondenceLetter::query()->find($letterId);

select * from `departments` where `departments`.`id` in (54) and `departments`.`deleted_at` is null order by `id` desc
select * from `users` where `users`.`id` in (149) and `users`.`deleted_at` is null order by `id` desc
select * from `correspondence_letter_distributions` where `correspondence_letter_distributions`.`letter_id` in (26) and `correspondence_letter_distributions`.`deleted_at` is null order by `id` desc
---
    public function show(Request $request, CorrespondenceLetter $letter)
    {
        $this->assertCanView($letter);
        $this->markCorrespondenceNotificationsRead((int) $letter->id);

        $originUnitOptions = $this->originOrgUnitOptions();

        $letter->load([
            'originDepartment',
            'assignedDepartment',
            'currentHandler',
            'actions',
            'distributions.targetDepartment',
            'distributions.targetUser',
            'distributions.childLetter.assignedDepartment',
            'parentLetter.originDepartment',
            'parentLetter.assignedDepartment',
            'childLetters.assignedDepartment',
        ]);

        $sourceDistribution = null;
        if ((int) ($letter->source_distribution_id ?? 0) > 0) {
            $sourceDistribution = CorrespondenceLetterDistribution::query()
                ->with(['letter', 'targetDepartment', 'targetUser'])
                ->find((int) $letter->source_distribution_id);

select `id`, `full_name`, `email` from `users` where `id` in (149, 25, 282, 596, 541, 45) and `users`.`deleted_at` is null
select `id`, `code` from `system_roles` where `system_roles`.`id` in (1, 2, 3, 9)
---
            ->unique()
            ->values();

        $userMap = User::query()
            ->withoutGlobalScope('sortByLatest')
            ->whereIn('id', $relatedUserIds)
            ->get(['id', 'full_name', 'email'])
            ->mapWithKeys(function ($item) {
                $name = trim((string) ($item->full_name ?? ''));
                $email = trim((string) ($item->email ?? ''));
                return [(int) $item->id => $email !== '' ? "{$name} ({$email})" : $name];
            })
            ->all();

        $userRoleMap = UserOrgRole::withoutGlobalScopes()
            ->effective()
            ->whereIn('user_id', $relatedUserIds)
            ->with('systemRole:id,code')
            ->get(['id', 'user_id', 'org_role', 'system_role_id'])
            ->groupBy('user_id')
            ->map(function ($rows) {
                $roleCodes = $rows
                    ->map(function ($row) {
                        return $row->getEffectiveRoleCode();
                    })
                    ->filter(fn ($code) => trim((string) $code) !== '')
                    ->values();

                $roleCode = $roleCodes->first(function ($code) {
                    return in_array((string) $code, [
                        UserOrgRole::ROLE_HEAD,
                        UserOrgRole::ROLE_DEPUTY_HEAD,
                        UserOrgRole::ROLE_MANAGER,
                    ], true);
                });

                if (!$roleCode) {
                    $roleCode = $roleCodes->first();
                }

select `id`, `department_name` from `departments` where `id` in (54)
---
            ->unique()
            ->values();

        $departmentMap = Department::withoutGlobalScopes()
            ->whereIn('id', $relatedDepartmentIds)
            ->get(['id', 'department_name'])
            ->mapWithKeys(fn ($item) => [(int) $item->id => (string) $item->department_name])
            ->all();

select `id` from `org_unit_types` where `code` in ('office', 'operational_district', 'provincial_hospital', 'district_hospital', 'health_center', 'health_center_with_bed', 'health_center_without_bed')
---
    protected function originOrgUnitOptions()
    {
        $allowedCodes = [
            'office',
            'operational_district',
            'provincial_hospital',
            'district_hospital',
            'health_center',
            'health_center_with_bed',
            'health_center_without_bed',
        ];

        $allowedTypeIds = OrgUnitType::query()
            ->whereIn('code', $allowedCodes)
            ->pluck('id')
            ->map(fn ($id) => (int) $id)
            ->values()
            ->all();

update `notifications` set `read_at` = '2026-05-02 12:19:58', `notifications`.`updated_at` = '2026-05-02 12:19:58' where `notifications`.`notifiable_type` = 'App\Models\User' and `notifications`.`notifiable_id` = 25 and `notifications`.`notifiable_id` is not null and `read_at` is null and `type` = 'App\Notifications\CorrespondenceAssignedNotification' and json_unquote(json_extract(`data`, '$."letter_id"')) = 26 order by `created_at` desc
---
    protected function markCorrespondenceNotificationsRead(int $letterId): void
    {
        if ($letterId <= 0) {
            return;
        }

        $user = Auth::user();
        if (!$user) {
            return;
        }

        $user->unreadNotifications()
            ->where('type', CorrespondenceAssignedNotification::class)
            ->where('data->letter_id', $letterId)
            ->update(['read_at' => now()]);