backend/app/Helpers/Helpers.php

    function otp_setting(): ?Appsetting
    {
        try {
            return Cache::remember('otp_setting', 300, function () {
                return Appsetting::query()->first();
            });
---
select * from `appsettings` where `appsettings`.`deleted_at` is null order by `id` desc limit 1