backend/modules/HumanResource/Http/Controllers/LeaveController.php

select * from `leave_types` where `leave_types`.`deleted_at` is null order by `id` desc
select * from `employees` where `is_active` = 1 and `employees`.`deleted_at` is null
select * from `employees` where `is_active` = 1 and `user_id` is not null and `employees`.`deleted_at` is null order by `first_name` asc, `last_name` asc
---
    public function index(LeaveApplicationDataTable $dataTable)
    {
        $leaveTypes = LeaveType::all();
        $currentUser = Auth::user();
        $isSystemAdmin = $currentUser ? $this->orgHierarchyAccessService()->isSystemAdmin($currentUser) : false;
        $currentEmployeeId = (int) ($currentUser?->employee?->id ?? 0);

        $employeesQuery = Employee::query()->where('is_active', 1);
        if (!$isSystemAdmin && $currentEmployeeId > 0) {
            $employeesQuery->where('id', $currentEmployeeId);
        }

        $employees = $employeesQuery->get();
        $handoverEmployees = Employee::query()
            ->where('is_active', 1)
            ->whereNotNull('user_id')
            ->orderBy('first_name')
            ->orderBy('last_name')
            ->get();

select * from `departments` where `departments`.`id` in (54) and `departments`.`deleted_at` is null order by `id` desc
select * from `employees` where `employees`.`id` in (931)
select * from `leave_types` where `leave_types`.`id` in (5) and `leave_types`.`deleted_at` is null order by `id` desc
select * from `system_roles` where `system_roles`.`id` in (9)
---
    public function reviewForm(ApplyLeave $leave)
    {
        $leave->load([
            'employee.primaryUnitPosting.department',
            'leaveType',
            'handoverEmployee',
            'workflowInstance.definition.steps.systemRole',
        ]);