backend/app/Http/Controllers/HomeController.php

    public function index()
    {
        $total_employee   = Employee::where('is_active', 1)->count();
        $present_employee = $this->count_attend_employee();
        $today_leave_data = $this->leave_employee();
        $today_leave      = $today_leave_data ? (int) $today_leave_data->leave_total : 0;

        $departments = Department::query()
            ->whereNull('parent_id')
            ->where('is_active', true)
            ->get(['id', 'department_name']);

        // department wise employee attendances
        $departmentWiseAttendanceReport = $this->attendanceDepartmentWise(0);

        // position wise candidate count
        $positionWiseAttendanceReport = $this->recruitmentPositionWise(0);

        // leave appropriated employee
        $leaveEmployees = ApplyLeave::with([
            'employee:id,employee_id,first_name,middle_name,last_name,email,position_id,department_id',
            'employee.position:id,position_name'
        ])
            ->latest()
            ->take(4)
            ->get();

        // recruitment employees
        $newCandidates = CandidateSelection::with([
            'employee:id,employee_id,first_name,middle_name,last_name,email,position_id,department_id',
            'employee.position:id,position_name'
        ])
            ->latest()
            ->take(3)
            ->get();

        // Notice list
        $notices = Notice::query()
            ->withoutGlobalScope('sortByLatest')
            ->orderByDesc('notice_date')
            ->orderByDesc('id')
            ->take(3)
            ->get();
---
select count(*) as aggregate from `employees` where `is_active` = 1 and `employees`.`deleted_at` is null
select `id`, `department_name` from `departments` where `parent_id` is null and `is_active` = 1 and `departments`.`deleted_at` is null order by `id` desc
select * from `apply_leaves` where `apply_leaves`.`deleted_at` is null order by `created_at` desc, `id` desc limit 4
select `id`, `employee_id`, `first_name`, `middle_name`, `last_name`, `email`, `position_id`, `department_id` from `employees` where `employees`.`id` in (931, 1126)
select `id`, `position_name` from `positions` where `positions`.`id` in (22, 38) order by `id` desc
select * from `candidate_selections` order by `created_at` desc limit 3
select * from `notices` where `notices`.`deleted_at` is null order by `notice_date` desc, `id` desc limit 3

            }
        }

        $awardRows = Award::query()
            ->join('employees', 'employees.id', '=', 'awards.employee_id')
            ->selectRaw('employees.department_id as department_id, MONTH(awards.date) as month_no, COUNT(*) as total')
            ->whereYear('awards.date', $currentYear)
            ->whereIn('employees.department_id', $departmentNameById->keys()->all())
            ->groupBy('employees.department_id', DB::raw('MONTH(awards.date)'))
            ->get();
---
select employees.department_id as department_id, MONTH(awards.date) as month_no, COUNT(*) as total from `awards` inner join `employees` on `employees`.`id` = `awards`.`employee_id` where year(`awards`.`date`) = 2026 and `employees`.`department_id` in (15) group by `employees`.`department_id`, MONTH(awards.date)

        }

        // award list
        $awards = Award::with(['employee:id,first_name,last_name,middle_name,email,department_id', 'employee.department'])
            ->latest()
            ->take(5)
            ->get();

        // loan received from system & loan paid from employee total amount
        $totalLoanPaid = (float) Loan::query()->sum('released_amount');
---
select * from `awards` order by `created_at` desc limit 5
select sum(`released_amount`) as aggregate from `loans` where `loans`.`deleted_at` is null

    public function count_attend_employee()
    {
        $date = date('Y-m-d');
        $result = DB::table('attendances')
            ->select(DB::raw('COUNT(*)'))
            ->whereDate('time', $date)
            ->whereNull('deleted_at') // Check if deleted_at is NULL
            ->groupBy('employee_id')
            ->get();
---
select COUNT(*) from `attendances` where date(`time`) = '2026-05-02' and `deleted_at` is null group by `employee_id`

    public function leave_employee()
    {
        $date  = date('Y-m-d');

        $result = DB::table('apply_leaves')
            ->select(DB::raw('COUNT(employee_id) as leave_total'))
            ->whereDate('leave_approved_start_date', '<=', $date)
            ->whereDate('leave_approved_end_date', '>=', $date)
            ->whereNull('deleted_at') // Check if deleted_at is NULL
            ->get();
---
select COUNT(employee_id) as leave_total from `apply_leaves` where date(`leave_approved_start_date`) <= '2026-05-02' and date(`leave_approved_end_date`) >= '2026-05-02' and `deleted_at` is null

    public function attendanceDepartmentWise($type)
    {
        [$fromDate, $toDate] = $this->resolveDateRangeByType(request()->get('type') ?? $type);

        $departments = Department::query()
            ->whereNull('parent_id')
            ->where('is_active', true)
            ->get(['id', 'department_name']);

        $departmentIds = $departments->pluck('id')->all();
        if (empty($departmentIds)) {
            return [];
        }

        $totalEmployeesByDepartment = Employee::query()
            ->select('department_id', DB::raw('COUNT(*) as total'))
            ->whereIn('department_id', $departmentIds)
            ->groupBy('department_id')
            ->pluck('total', 'department_id');

        $presentByDepartment = DB::table('attendances')
            ->join('employees', 'employees.id', '=', 'attendances.employee_id')
            ->whereIn('employees.department_id', $departmentIds)
            ->whereBetween('attendances.time', [$fromDate, $toDate])
            ->whereNull('employees.deleted_at')
            ->whereNull('attendances.deleted_at')
            ->select('employees.department_id', DB::raw('COUNT(DISTINCT attendances.employee_id) as present_count'))
            ->groupBy('employees.department_id')
            ->pluck('present_count', 'employees.department_id');

        $fromDateOnly = $fromDate->toDateString();
        $toDateOnly = $toDate->toDateString();
        $leaveByDepartment = DB::table('apply_leaves')
            ->join('employees', 'employees.id', '=', 'apply_leaves.employee_id')
            ->whereIn('employees.department_id', $departmentIds)
            ->whereNull('employees.deleted_at')
            ->whereNull('apply_leaves.deleted_at')
            ->where(function ($query) use ($fromDateOnly, $toDateOnly) {
                $query->whereBetween('leave_apply_start_date', [$fromDateOnly, $toDateOnly])
                    ->orWhereBetween('leave_apply_end_date', [$fromDateOnly, $toDateOnly])
                    ->orWhere(function ($subQuery) use ($fromDateOnly, $toDateOnly) {
                        $subQuery->where('leave_apply_start_date', '<=', $fromDateOnly)
                            ->where('leave_apply_end_date', '>=', $toDateOnly);
                    });
            })
            ->select('employees.department_id', DB::raw('COUNT(DISTINCT apply_leaves.employee_id) as leave_count'))
            ->groupBy('employees.department_id')
            ->pluck('leave_count', 'employees.department_id');
---
select `id`, `department_name` from `departments` where `parent_id` is null and `is_active` = 1 and `departments`.`deleted_at` is null order by `id` desc
select `department_id`, COUNT(*) as total from `employees` where `department_id` in (15) and `employees`.`deleted_at` is null group by `department_id`
select `employees`.`department_id`, COUNT(DISTINCT attendances.employee_id) as present_count from `attendances` inner join `employees` on `employees`.`id` = `attendances`.`employee_id` where `employees`.`department_id` in (15) and `attendances`.`time` between '2026-05-02 00:00:00' and '2026-05-02 23:59:59' and `employees`.`deleted_at` is null and `attendances`.`deleted_at` is null group by `employees`.`department_id`
select `employees`.`department_id`, COUNT(DISTINCT apply_leaves.employee_id) as leave_count from `apply_leaves` inner join `employees` on `employees`.`id` = `apply_leaves`.`employee_id` where `employees`.`department_id` in (15) and `employees`.`deleted_at` is null and `apply_leaves`.`deleted_at` is null and (`leave_apply_start_date` between '2026-05-02' and '2026-05-02' or `leave_apply_end_date` between '2026-05-02' and '2026-05-02' or (`leave_apply_start_date` <= '2026-05-02' and `leave_apply_end_date` >= '2026-05-02')) group by `employees`.`department_id`

    public function recruitmentPositionWise(int $type)
    {
        [$fromDate, $toDate] = $this->resolveDateRangeByType(request()->get('type') ?? $type);

        $positions = Position::query()
            ->where('is_active', true)
            ->get(['id', 'position_name', 'is_active']);

        $candidateCountByPosition = CandidateSelection::query()
            ->select('position_id', DB::raw('COUNT(*) as total'))
            ->whereBetween('created_at', [$fromDate, $toDate])
            ->groupBy('position_id')
            ->pluck('total', 'position_id');
---
select `id`, `position_name`, `is_active` from `positions` where `is_active` = 1 and `positions`.`deleted_at` is null order by `id` desc
select `position_id`, COUNT(*) as total from `candidate_selections` where `created_at` between '2026-05-02 00:00:00' and '2026-05-02 23:59:59' group by `position_id`